## NBA Team Valuations - ETL Project
<font color=gray>__Group: Camila Cois and Mudit Mathur__</font>


### Project Proposal: 
__What factors go into the valuation of an NBA franchise a.k.a. what determines how much an NBA franchise is worth?__
***
### Finding Data (EXTRACT):
__We asked ourselves what variables would have an effect on how much an individual NBA Franchise is worth? We considered game attendance, team performance, and superstar power.__ 
   
__1) Kaggle__ 

-  We found an NBA Team Valuation database on their with 2017 team valuations for every franchise.

-  We additionally found another Kaggle dataset with aggregate individual player statistics for 67 NBA seasons -- we chose the 2017 csv file to compare to the same year of Team Valuation dataset. 
    
__2) FiveThirtyEight__
-  Nate Silver's blog provides excellent sports data. In this case, we wanted an "advanced" stat that calculates every franchises' relative strength after each game. For more information, please see link:
[FiveThirtyEight](https://projects.fivethirtyeight.com/complete-history-of-the-nba/#raptors)

-  We took the Elo ratings of each team after the 2017 NBA season to measure general performance during the course of a regular season. 
***
### Data Cleanup & Analysis (TRANSFORM)
__A lot of the CSVs that we extracted had excess information for this project__

- Our attendance, valuations, and ELO had to first be cleaned up after converting CSV to DataFrame by filtering only the relevant columns for this project.

- We renamed columns to be consistent between dataframes and used team name as a common column amongst all dataframes.

- The players statistics CSV was particularly unwieldy. We had a dataset on every single player and his statistics for the full 2017 season. 

- To determine "star power" we only wanted to keep the players that had the highest PPG (points per game) of their team. A high scoring player is likely to give a franchise more attention and therefore increase its value. 

- We grouped all the players in the NBA database by team and then sorted by PPG. We then were able to select only the player that scored the highest on each team and create a new dataframe pairing every team to it's highest scorer.
***
### Deploying Data (LOAD):
__The final database, and other tables, were finally loaded into PostgreSQL from Python. We chose PostgreSQL for a few reasons.__ 
1. One of the main advantages of using NoSQL (such as MongoDB) is that it can "scale out", however the fairly restrictive memory requirements for this project did not make that necessary. 
2. We preferred the table format and structured data of PostgreSQL. Also, the more established community in case we needed help. 
3. In order to connect to the PostgreSQL database server in Python program, we used psycopg database adapter.
***
<img src='nba_players.png' width="500" height="250"/>

In [1]:
import pandas as pd
from sqlalchemy import create_engine

### Extract CSVs into DataFrames

In [2]:
attendance_file = "Resources/nba_2017_attendance.csv"

In [3]:
attendance_df = pd.read_csv(attendance_file)
attendance_df.head()

               TEAM  GMS   TOTAL    AVG    PCT
0     Chicago Bulls   41  888882  21680  103.6
1  Dallas Mavericks   41  811366  19789  103.1
2  Sacramento Kings   41  721928  17608  100.6
3        Miami Heat   41  805400  19643  100.2
4   Toronto Raptors   41  813050  19830  100.2

In [4]:
valuations_file = "Resources/nba_2017_team_valuations.csv"

In [5]:
valuations_df = pd.read_csv(valuations_file)
valuations_df.head()

                    TEAM  VALUE_MILLIONS
0        New York Knicks          3300.0
1     Los Angeles Lakers          3000.0
2  Golden State Warriors          2600.0
3          Chicago Bulls          2500.0
4         Boston Celtics          2200.0

In [6]:
elo_file = "Resources/nba_2017_elo.csv"

In [7]:
elo_df = pd.read_csv(elo_file)
elo_df.head()

    ELO                   TEAM  CONF
0  1770  Golden State Warriors  West
1  1661      San Antonio Spurs  West
2  1636   Los Angeles Clippers  West
3  1617              Utah Jazz  West
4  1602        Houston Rockets  West

In [8]:
stats_file = "Resources/nba_2017_players_stats_combined.csv"

In [9]:
stats_df = pd.read_csv(stats_file)
stats_df.head()

,Unnamed: 0,Rk,PLAYER,POSITION,AGE,MP,FG,FGA,FG%,3P,...,TEAM,GP,MPG,ORPM,DRPM,RPM,WINS_RPM,PIE,PACE,W
0,0,1,Russell Westbrook,PG,28,34.6,10.2,24.0,0.425,2.5,...,OKC,81,34.6,6.74,-0.47,6.27,17.34,23.0,102.31,46
1,1,2,James Harden,PG,27,36.4,8.3,18.9,0.440,3.2,...,HOU,81,36.4,6.38,-1.57,4.81,15.54,19.0,102.98,54
2,2,3,Isaiah Thomas,PG,27,33.8,9.0,19.4,0.463,3.2,...,BOS,76,33.8,5.72,-3.89,1.83,8.19,16.1,99.84,51
3,3,4,Anthony Davis,C,23,36.1,10.3,20.3,0.505,0.5,...,NO,75,36.1,0.45,3.90,4.35,12.81,19.2,100.19,31
4,4,5,DeMar DeRozan,SG,27,35.4,9.7,20.9,0.467,0.4,...,TOR,74,35.4,2.21,-2.04,0.17,5.46,15.5,97.69,47

In [10]:
names_file = "Resources/NBA_abbreviations.csv"

In [11]:
names_df = pd.read_csv(names_file)
names_df.head()

  Abbreviation          Franchise
0          ATL      Atlanta Hawks
1          BKN      Brooklyn Nets
2          BOS     Boston Celtics
3          CHA  Charlotte Hornets
4          CHI      Chicago Bulls

### Transform premise DataFrame

In [12]:
# Create a filtered dataframe from specific columns
attendance_transformed = attendance_df[['TEAM','TOTAL','PCT']].copy()
attendance_transformed.head()

               TEAM   TOTAL    PCT
0     Chicago Bulls  888882  103.6
1  Dallas Mavericks  811366  103.1
2  Sacramento Kings  721928  100.6
3        Miami Heat  805400  100.2
4   Toronto Raptors  813050  100.2

In [13]:
# Create a filtered dataframe from specific columns
elo_transformed = elo_df[['ELO','TEAM']].copy()
elo_transformed.head()

    ELO                   TEAM
0  1770  Golden State Warriors
1  1661      San Antonio Spurs
2  1636   Los Angeles Clippers
3  1617              Utah Jazz
4  1602        Houston Rockets

In [14]:
# Create a filtered dataframe from specific columns
stats_transformed = stats_df[['TEAM', 'PLAYER', 'POINTS']].copy()
stats_transformed.head()

  TEAM             PLAYER  POINTS
0  OKC  Russell Westbrook    31.6
1  HOU       James Harden    29.1
2  BOS      Isaiah Thomas    28.9
3   NO      Anthony Davis    28.0
4  TOR      DeMar DeRozan    27.3

In [15]:
# Rename the column headers to merge on 'Abbreviation'
stats_transformed.columns = ['Abbreviation', 'PLAYER', 'POINTS'].copy()
stats_transformed.head()

  Abbreviation             PLAYER  POINTS
0          OKC  Russell Westbrook    31.6
1          HOU       James Harden    29.1
2          BOS      Isaiah Thomas    28.9
3           NO      Anthony Davis    28.0
4          TOR      DeMar DeRozan    27.3

In [16]:
# Rename the column headers to merge on 'Abbreviation'
names_df.columns = ['Abbreviation', 'TEAM'].copy()
names_df.head()

  Abbreviation               TEAM
0          ATL      Atlanta Hawks
1          BKN      Brooklyn Nets
2          BOS     Boston Celtics
3          CHA  Charlotte Hornets
4          CHI      Chicago Bulls

In [17]:
# Merge on 'Abbreviation' to create a DataFrame with team names and player names
players_stats = pd.merge(stats_transformed, names_df[['Abbreviation', 'TEAM']], on='Abbreviation')
players_stats.head()

  Abbreviation             PLAYER  POINTS                   TEAM
0          OKC  Russell Westbrook    31.6  Oklahoma City Thunder
1          OKC     Victor Oladipo    15.9  Oklahoma City Thunder
2          OKC        Enes Kanter    14.3  Oklahoma City Thunder
3          OKC       Steven Adams    11.3  Oklahoma City Thunder
4          OKC       Josh Huestis     7.0  Oklahoma City Thunder

In [18]:
# Drop 'Abbreviation' column
players_df = players_stats.drop(['Abbreviation'], axis=1)

In [19]:
# Create a DataFrame sorting by number of 'points' - ascending
players_transformed = players_df.sort_values('POINTS').groupby('TEAM').last().reset_index()
players_transformed.head()

                TEAM         PLAYER  POINTS
0      Atlanta Hawks   Paul Millsap    18.1
1     Boston Celtics  Isaiah Thomas    28.9
2      Brooklyn Nets    Brook Lopez    20.5
3  Charlotte Hornets   Kemba Walker    23.2
4      Chicago Bulls   Jimmy Butler    23.9

In [20]:
# Merge DataFrames to create a final DataFrame with all necessary columns
first_merge = pd.merge(attendance_transformed, valuations_df[['TEAM', 'VALUE_MILLIONS']], on='TEAM')
second_merge = pd.merge(first_merge, elo_transformed[['ELO', 'TEAM']], on='TEAM')
nba_final_merge = pd.merge(second_merge, players_transformed[['TEAM', 'PLAYER', 'POINTS']], on='TEAM')

# Move 'Value_Millions' column to the end of the table
nba_final_merge_transformed = nba_final_merge[['TEAM', 'TOTAL', 'PCT','ELO', 'PLAYER', 'POINTS','VALUE_MILLIONS',]]

# Rename the column headers
nba_final_merge_transformed.columns = ['TEAM_NAME', 'TOTAL_ATTENDANCE', 'PCT_ATTENDANCE','ELO',
                                       'PLAYER', 'POINTS_BY_PLAYER', 'VALUE_MILLIONS',]
nba_final_merge_transformed.head()

,TEAM_NAME,TOTAL_ATTENDANCE,PCT_ATTENDANCE,ELO,PLAYER,POINTS_BY_PLAYER,VALUE_MILLIONS
0,Chicago Bulls,888882,103.6,1519,Jimmy Butler,23.9,2500.0
1,Dallas Mavericks,811366,103.1,1420,Harrison Barnes,19.2,1450.0
2,Sacramento Kings,721928,100.6,1393,Rudy Gay,18.7,1075.0
3,Miami Heat,805400,100.2,1569,Goran Dragic,20.3,1350.0
4,Toronto Raptors,813050,100.2,1600,DeMar DeRozan,27.3,1125.0

In [21]:
# Create a DataFrame sorting by number of 'Value_Millions' - descending - and reset index
nba_final_transformed = nba_final_merge_transformed.sort_values(by='VALUE_MILLIONS', ascending=False).reset_index()

# Drop extra 'index' column
nba_final = nba_final_transformed.drop(['index'], axis=1)

nba_final.head()

,TEAM_NAME,TOTAL_ATTENDANCE,PCT_ATTENDANCE,ELO,PLAYER,POINTS_BY_PLAYER,VALUE_MILLIONS
0,New York Knicks,810741,99.8,1374,Carmelo Anthony,22.4,3300.0
1,Los Angeles Lakers,776917,99.4,1367,D'Angelo Russell,15.6,3000.0
2,Golden State Warriors,803436,100.0,1770,Stephen Curry,25.3,2600.0
3,Chicago Bulls,888882,103.6,1519,Jimmy Butler,23.9,2500.0
4,Boston Celtics,760690,99.6,1587,Isaiah Thomas,28.9,2200.0

In [22]:
import seaborn as sns

corr = nba_final.corr()
ax = sns.heatmap(
    corr, 
    vmin=-1, vmax=1, center=0,
    cmap=sns.diverging_palette(20, 220, n=200),
    square=True
)
ax.set_xticklabels(
    ax.get_xticklabels(),
    rotation=45,
    horizontalalignment='right'
);

corr

,TOTAL_ATTENDANCE,PCT_ATTENDANCE,ELO,POINTS_BY_PLAYER,VALUE_MILLIONS
TOTAL_ATTENDANCE,1.000000,0.852291,0.285907,0.206582,0.530697
PCT_ATTENDANCE,0.852291,1.000000,0.249979,0.333891,0.475642
ELO,0.285907,0.249979,1.000000,0.528082,0.060575
POINTS_BY_PLAYER,0.206582,0.333891,0.528082,1.000000,-0.007617
VALUE_MILLIONS,0.530697,0.475642,0.060575,-0.007617,1.000000

###  Connect to local database

In [38]:
 !pip install psycopg2-binary
from pg_pw import pw

Requirement already satisfied: psycopg2-binary in c:\users\mudit mathur\anaconda3\lib\site-packages (2.8.3)

In [39]:
# Create connection
engine = create_engine('postgresql://postgres:{password}@localhost:5432/ETL_NBA_Valuations'
                        .format(password=pw))

connection = engine.connect()

### Check for tables

In [40]:
engine.table_names()

['attendance', 'team_value', 'players_stats', 'elo_rating', 'nba_valuations']

### Load DataFrames into database

In [26]:
attendance_transformed.to_sql(name='attendance', con=engine, if_exists='replace', index=False)

In [27]:
valuations_df.to_sql(name='team_value', con=engine, if_exists='replace', index=False)

In [28]:
players_transformed.to_sql(name='players_stats', con=engine, if_exists='replace', index=False)

In [29]:
elo_transformed.to_sql(name='elo_rating', con=engine, if_exists='replace', index=False)

In [30]:
nba_final.to_sql(name='nba_valuations', con=engine, if_exists='replace', index=False)

###  Confirm if data has been added by querying the table's name

In [31]:
 pd.read_sql_query('select * from attendance', con=engine).head()

               TEAM   TOTAL    PCT
0     Chicago Bulls  888882  103.6
1  Dallas Mavericks  811366  103.1
2  Sacramento Kings  721928  100.6
3        Miami Heat  805400  100.2
4   Toronto Raptors  813050  100.2

In [32]:
 pd.read_sql_query('select * from team_value', con=engine).head()

                    TEAM  VALUE_MILLIONS
0        New York Knicks          3300.0
1     Los Angeles Lakers          3000.0
2  Golden State Warriors          2600.0
3          Chicago Bulls          2500.0
4         Boston Celtics          2200.0

In [33]:
 pd.read_sql_query('select * from players_stats', con=engine).head()

                TEAM         PLAYER  POINTS
0      Atlanta Hawks   Paul Millsap    18.1
1     Boston Celtics  Isaiah Thomas    28.9
2      Brooklyn Nets    Brook Lopez    20.5
3  Charlotte Hornets   Kemba Walker    23.2
4      Chicago Bulls   Jimmy Butler    23.9

In [34]:
 pd.read_sql_query('select * from elo_rating', con=engine).head()

    ELO                   TEAM
0  1770  Golden State Warriors
1  1661      San Antonio Spurs
2  1636   Los Angeles Clippers
3  1617              Utah Jazz
4  1602        Houston Rockets

In [35]:
pd.read_sql_query('select * from nba_valuations', con=engine).head()

,TEAM_NAME,TOTAL_ATTENDANCE,PCT_ATTENDANCE,ELO,PLAYER,POINTS_BY_PLAYER,VALUE_MILLIONS
0,New York Knicks,810741,99.8,1374,Carmelo Anthony,22.4,3300.0
1,Los Angeles Lakers,776917,99.4,1367,D'Angelo Russell,15.6,3000.0
2,Golden State Warriors,803436,100.0,1770,Stephen Curry,25.3,2600.0
3,Chicago Bulls,888882,103.6,1519,Jimmy Butler,23.9,2500.0
4,Boston Celtics,760690,99.6,1587,Isaiah Thomas,28.9,2200.0